; domain
(define (domain blocks)
  (:requirements :strips :equality :disjunctive-preconditions :derived-predicates :negative-preconditions :conditional-effects :existential-preconditions :typing)

  (:types
    robot block - object
  )

  (:predicates 
    (on ?block1 - block ?block2 - block)
    (ontable ?block - block)
    (clear ?block - block)
    (KBquery_fullHands ?robot - robot)
    (holding ?robot - robot ?block - block)
  )

  (:action pick-up
    :parameters (?robot - robot ?block - block)
    :precondition (and 
      (clear ?block) 
      (ontable ?block) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (not (ontable ?block))
        (not (clear ?block))
        (holding ?robot ?block)
      )
  )

  (:action put-down
    :parameters (?robot - robot ?block - block)
    :precondition (holding ?robot ?block)
    :effect
      (and 
        (not (holding ?robot ?block))
        (clear ?block)
        (ontable ?block)
      )
  )

  (:action stack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (holding ?robot ?block1) 
      (clear ?block2)
      )
    :effect
      (and 
        (not (holding ?robot ?block1))
        (not (clear ?block2))
        (clear ?block1)
        (on ?block1 ?block2)
      )
  )

  (:action unstack
    :parameters (?robot - robot ?block1 - block ?block2 - block)
    :precondition (and 
      (on ?block1 ?block2) 
      (clear ?block1) 
      (not (KBquery_fullHands ?robot))
    )
    :effect
      (and 
        (holding ?robot ?block1)
        (clear ?block2)
        (not (clear ?block1))
        (not (on ?block2 ?block1))
      )
  )
)

; problem
(define (problem BLOCKS-5-2)
(:domain BLOCKS)
(:objects B E A C D - block pr2 - robot)
(:INIT (CLEAR D) (ONTABLE B) (ON D E) (ON E C) (ON C A) (ON A B))
(:goal (AND (ON D C) (ON C B) (ON B E) (ON E A)))
)

; plan
1. (unstack pr2 d e)
   deleted: (clear d)
   added: (holding pr2 d) (clear e)
   goals met: 0 of 4
2. (unstack pr2 e c)
   deleted: (clear e)
   added: (holding pr2 e) (clear c)
   goals met: 0 of 4
3. (stack pr2 d c)
   deleted: (holding pr2 d) (clear c)
   added: (clear d) (on d c)
   goals met: 1 of 4
4. (unstack pr2 d c)
   deleted: (clear d)
   added: (holding pr2 d) (clear c)
   goals met: 1 of 4
5. (put-down pr2 d)
   deleted: (holding pr2 d)
   added: (clear d) (ontable d)
   goals met: 1 of 4
6. (unstack pr2 c a)
   deleted: (clear c)
   added: (holding pr2 c) (clear a)
   goals met: 1 of 4
7. (put-down pr2 c)
   deleted: (holding pr2 c)
   added: (clear c) (ontable c)
   goals met: 1 of 4
8. (unstack pr2 a b)
   deleted: (clear a)
   added: (holding pr2 a) (clear b)
   goals met: 1 of 4
9. (put-down pr2 a)
   deleted: (holding pr2 a)
   added: (clear a) (ontable a)
   goals met: 1 of 4
10. (pick-up pr2 c)
   deleted: (ontable c) (clear c)
   added: (holding pr2 c)
   goals met: 1 of 4
11. (stack pr2 e a)
   deleted: (holding pr2 e) (clear a)
   added: (clear e) (on e a)
   goals met: 2 of 4
12. (pick-up pr2 b)
   deleted: (ontable b) (clear b)
   added: (holding pr2 b)
   goals met: 2 of 4
13. (stack pr2 b e)
   deleted: (holding pr2 b) (clear e)
   added: (clear b) (on b e)
   goals met: 3 of 4
14. (stack pr2 c b)
   deleted: (holding pr2 c) (clear b)
   added: (clear c) (on c b)
   goals met: 4 of 4
